In [3]:
import numpy as np
speed = [99,86,87,88,111,86,103,87,94,78,77,85,86]
x = np.mean(speed)
print(x)

89.76923076923077

In [5]:
x=np.median(speed)
print(x)

87.0

In [10]:
from scipy import stats
x=stats.mode(speed)
print(x)

#The 'np.int64' indicates that this value is stored as a 64-bit integer.
#'count=np.int64(3)' - This shows that the value 86 appears 3 times in the dataset.

ModeResult(mode=np.int64(86), count=np.int64(3))

In [9]:
import statistics as stats
x=stats.mode(speed)
print(x)

86

In [21]:
import pandas as pd
df=pd.read_csv("Salaries.csv")
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [12]:
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [13]:
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [14]:
df.tail(10)

         rank discipline  phd  service     sex  salary
68   AsstProf          A    4        2  Female   77500
69       Prof          A   28        7  Female  116450
70   AsstProf          A    8        3  Female   78500
71  AssocProf          B   12        9  Female   71065
72       Prof          B   24       15  Female  161101
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [15]:
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [17]:
df.max()

#`df.max()` calculates the maximum value for each column in the DataFrame `df`.

rank            Prof
discipline         B
phd               56
service           51
sex             Male
salary        186960
dtype: object

In [18]:
df.min()

rank          AssocProf
discipline            A
phd                   1
service               0
sex              Female
salary            57800
dtype: object

In [26]:
df.size

468

In [32]:
df.shape

(78, 6)

In [28]:
df.iloc[2:4]

   rank discipline  phd  service   sex  salary
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 78 entries, 0 to 77
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   rank        78 non-null     object
 1   discipline  78 non-null     object
 2   phd         78 non-null     int64
 3   service     78 non-null     int64
 4   sex         78 non-null     object
 5   salary      78 non-null     int64
dtypes: int64(3), object(3)
memory usage: 3.8+ KB

In [33]:
df['discipline'].dtype

dtype('O')

In [35]:
sd = df.std(numeric_only=True)
sd

phd           12.498425
service       12.139768
salary     28293.661022
dtype: float64

In [37]:
mean1 = df.mean(numeric_only=True)
mean1

phd            19.705128
service        15.051282
salary     108023.782051
dtype: float64

In [38]:
df['phd'].describe()

count    78.000000
mean     19.705128
std      12.498425
min       1.000000
25%      10.250000
50%      18.500000
75%      27.750000
max      56.000000
Name: phd, dtype: float64

In [40]:
df['phd'].mean()

np.float64(19.705128205128204)

In [45]:
df.groupby('rank')[['salary']].mean ()

                  salary
rank
AssocProf   91786.230769
AsstProf    81362.789474
Prof       123624.804348

In [48]:
df[ df['salary'] > 150000]

    rank discipline  phd  service     sex  salary
0   Prof          B   56       49    Male  186960
13  Prof          B   35       33    Male  162200
14  Prof          B   25       19    Male  153750
15  Prof          B   17        3    Male  150480
19  Prof          A   29       27    Male  150500
27  Prof          A   45       43    Male  155865
31  Prof          B   22       21    Male  155750
44  Prof          B   23       19  Female  151768
72  Prof          B   24       15  Female  161101

In [51]:
df[df['sex'] == 'Male']

         rank discipline  phd  service   sex  salary
0        Prof          B   56       49  Male  186960
1        Prof          A   12        6  Male   93000
2        Prof          A   23       20  Male  110515
3        Prof          A   40       31  Male  131205
4        Prof          B   20       18  Male  104800
5        Prof          A   20       20  Male  122400
6   AssocProf          A   20       17  Male   81285
7        Prof          A   18       18  Male  126300
8        Prof          A   29       19  Male   94350
9        Prof          A   51       51  Male   57800
10       Prof          B   39       33  Male  128250
11       Prof          B   23       23  Male  134778
12   AsstProf          B    1        0  Male   88000
13       Prof          B   35       33  Male  162200
14       Prof          B   25       19  Male  153750
15       Prof          B   17        3  Male  150480
16   AsstProf          B    8        3  Male   75044
17   AsstProf          B    4        0  Male   92000
18       Prof          A   19        7  Male  107300
19       Prof          A   29       27  Male  150500
20   AsstProf          B    4        4  Male   92000
21       Prof          A   33       30  Male  103106
22   AsstProf          A    4        2  Male   73000
23   AsstProf          A    2        0  Male   85000
24       Prof          A   30       23  Male   91100
25       Prof          B   35       31  Male   99418
26       Prof          A   38       19  Male  148750
27       Prof          A   45       43  Male  155865
28   AsstProf          B    7        2  Male   91300
29       Prof          B   21       20  Male  123683
30  AssocProf          B    9        7  Male  107008
31       Prof          B   22       21  Male  155750
32       Prof          A   27       19  Male  103275
33       Prof          B   18       18  Male  120000
34  AssocProf          B   12        8  Male  119800
35       Prof          B   28       23  Male  126933
36       Prof          B   45       45  Male  146856
37       Prof          A   20        8  Male  102000
38   AsstProf          B    4        3  Male   91000

In [52]:
df[['phd','salary']].agg(['min','mean','max' ])

            phd         salary
min    1.000000   57800.000000
mean  19.705128  108023.782051
max   56.000000  186960.000000

In [55]:
dic={"Name": "Nashwa", "City": "Mumbai", "Year" :2025}
dic

{'Name': 'Nashwa', 'City': 'Mumbai', 'Year': 2025}

In [60]:
dic={"Name": ["Nannu", "chinnu"], "City" : ["Mumbai", "Indore"], "Year" : [2025, 2021]}
dic

{'Name': ['Nannu', 'chinnu'],
 'City': ['Mumbai', 'Indore'],
 'Year': [2025, 2021]}

In [61]:
dic=pd.DataFrame({"Name":["Nikanksha","Sita"],"City":["Mumbai","Indore"],"Year":[2025,2021]})
dic

        Name    City  Year
0  Nikanksha  Mumbai  2025
1       Sita  Indore  2021

In [64]:
l=['ok','fine','happy']
pd.Series(l)

0       ok
1     fine
2    happy
dtype: object